#ฟังก์ชั่นหาค่าbmi
def bmi(w, h):
    bmi2 = w/(h/100) ** 2
    return bmi2

w = float(input("น้ำหนัก (kg): "))
h = float(input("ส่วนสูง (cm): "))

bmi2 = bmi(w, h)

print("ค่าBMI ของคุณคือ: %.2f" % bmi2)

if bmi2 <= 18.50 :
    print("น้ำหนักน้อย/ผอม ภาวะเสี่ยงโรคมากกว่าคนปกติ")
elif bmi2 >= 18.50 and bmi2 <= 22.90:
    print("ปกติ(สุขภาพดี) ภาวะเสี่ยงโรคเท่าคนปกติ")
elif bmi2 >= 23 and bmi2 <= 24.90:
    print("ท้วม/โรคอ้วนระดับ1 ภาวะเสี่ยงโรคอันตรายอันดับ1")
elif bmi2 >= 25 and bmi2 <= 29.90:
    print("อ้วน/โรคอ้วนระดับ2 ภาวะเสี่ยงโรคอันตรายอันดับ2")
else:
    print("อ้วนมาก/โรคอ้วนระดับ3 ภาวะเสี่ยงโรคอันตรายอันดับ3")
    