weight = int(input("น้ำหนักตัว กก: "))
height = int(input("ส่วนสูง CM: "))
BMI = weight/((height/100) ** 2)
print("คำตอบ %.2f" % BMI)

if BMI <= 18.50 :
    print("น้ำหนักน้อย/ผอม ภาวะเสี่ยงโรคมากกว่าคนปกติ")
elif BMI >= 18.50 and BMI <= 22.90:
    print("ปกติ(สุขภาพดี) ภาวะเสี่ยงโรคเท่าคนปกติ")
elif BMI >= 23 and BMI <= 24.90:
    print("ท้วม/โรคอ้วนระดับ1 ภาวะเสี่ยงโรคอันตรายอันดับ1")
elif BMI >= 25 and BMI <= 29.90:
    print("อ้วน/โรคอ้วนระดับ2 ภาวะเสี่ยงโรคอันตรายอันดับ2")
else:
    print("อ้วนมาก/โรคอ้วนระดับ3 ภาวะเสี่ยงโรคอันตรายอันดับ3")